Core/src/DataProcessors/ВедомостьОСуммированииНоменклатур/ВедомостьОСуммированииНоменклатур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВедомостьОСуммированииНоменклатур</name>
  <tabularSections>
    <name>Водители</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладВодителя</name>
      <comment>Склад</comment>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыписыватьГарантийныйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПрайсЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендуемЗаказать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияФлагаНовинка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭДГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяНоменклатураВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто (кг) (Gross Weight)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасовРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Неактивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПереработчикуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИмпорта</name>
    <type>
      <types>CatalogRef.ПроцентыИмпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <comment>Вес брутто (кг) (Gross Weight)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДляЧекаККМ</name>
    <type>
      <types>EnumRef.ВидыЧековДляНоменклатурыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Усушка_Потери</name>
    <type>
      <types>CatalogRef.Потери</types>
    </type>
  </attributes>
  <attributes>
    <name>Усушка_СписаниеНаПотери</name>
    <type>
      <types>CatalogRef.СписаниеНаПотери</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНомерЯчейки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpНоменклатурныеГруппы</name>
    <type>
      <types>CatalogRef.AzRytmpНоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpGUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/DataProcessors/ВедомостьОСуммированииНоменклатур/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода	= НачалоМесяца(ТекущаяДата());
	КонецПериода	= ТекущаяДата();
	
	ЗагрузитьВодители();
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)

	ОчиститьСообщения();
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Водители.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0 Тогда
		Предупреждение("არ არის მონიშნული არცერთი მძღოლი!", 60);
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ОтображатьСетку		= Ложь;
	ТабДок.Защита				= Ложь;
	ТабДок.ТолькоПросмотр		= Ложь;
	ТабДок.ОтображатьЗаголовки	= Ложь;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ПолеСверху			= 1;
	ТабДок.ПолеСлева			= 1;
	ТабДок.ПолеСнизу			= 1;
	ТабДок.ПолеСправа			= 1;
	//ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	
	ПечатьНаСервере(ТабДок);
	ТабДок.Показать();//"საქონლის აჯამების უწყისი"
	
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ТабДок)

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//	|	ОПТИМУС_Дистрибуция.СтруктурнаяЕдиница КАК СкладВодителя,
	//	|	ОПТИМУС_Дистрибуция.ТранспортноеСредство,
	//	|	ОПТИМУС_Дистрибуция.ТранспортноеСредство.ОсновнойВодитель КАК Водитель,
	//	|	ОПТИМУС_Дистрибуция.Ответственный,
	//	|	ОПТИМУС_Дистрибуция.ТранспортноеСредство.НомернойЗнак КАК НомерТС
	//	|ИЗ
	//	|	ПланОбмена.ОПТИМУС_Дистрибуция КАК ОПТИМУС_Дистрибуция
	//	|ГДЕ
	//	|	НЕ ОПТИМУС_Дистрибуция.ПометкаУдаления
	//	|	И ОПТИМУС_Дистрибуция.Ответственный = &Сотрудник";
	//Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	//ВыборкаВодитель = Запрос.Выполнить().Выбрать();
	//Если ВыборкаВодитель.Следующий() Тогда
	//	Ответственный			= ВыборкаВодитель.Ответственный;
	//	Водитель				= ВыборкаВодитель.Водитель;
	//	СкладВодителя			= ВыборкаВодитель.СкладВодителя;
	//	ТранспортноеСредство	= ВыборкаВодитель.ТранспортноеСредство;
	//	НомерТС            		= ВыборкаВодитель.НомерТС
	//Иначе
	//	Возврат;
	//КонецЕсли;
	
	Макет = Обработки.ВедомостьОСуммированииНоменклатур.ПолучитьМакет("МакетВедомостьОСуммированииНоменклатур");           			
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница КАК Склад,
		|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмеренияТЧ,
		|	РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияНоменклатуры,
		|	ВЫБОР
		|		КОГДА РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.КлассификаторЕдиницИзмерения
		|			ТОГДА РасходнаяНакладнаяЗапасы.Количество
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Количество * ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
		|	КОНЕЦ КАК КоличествоХранения,
		|	ВЫБОР
		|		КОГДА РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕдиницаДополнительная,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Договор.Водитель КАК Водитель
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
		|ГДЕ
		|	РасходнаяНакладнаяЗапасы.Ссылка.Проведен
		|	И РасходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РасходнаяНакладнаяЗапасы.Ссылка.Договор.Водитель В(&Водители)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Номенклатура,
		|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод
		|ПОМЕСТИТЬ ВТ_Штрихкоды
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_ТЧ.Номенклатура
		|			ИЗ
		|				ВТ_ТЧ КАК ВТ_ТЧ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ШтрихкодыНоменклатуры.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТЧ.Номенклатура,
		|	ВТ_ТЧ.ЕдиницаИзмеренияТЧ КАК ДопЕдИзм
		|ПОМЕСТИТЬ ВТ_ДопИзмеренияИзТЧ
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|ГДЕ
		|	ВТ_ТЧ.ЕдиницаДополнительная
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДопЕдИзм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДопИзмеренияИзТЧ.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫРАЗИТЬ(ВТ_ДопИзмеренияИзТЧ.ДопЕдИзм КАК Справочник.ЕдиницыИзмерения)) КАК ДопЕдИзм
		|ПОМЕСТИТЬ ВТ_ДопЕдиницы
		|ИЗ
		|	ВТ_ДопИзмеренияИзТЧ КАК ВТ_ДопИзмеренияИзТЧ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДопИзмеренияИзТЧ.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура),
		|	МАКСИМУМ(ЕдиницыИзмерения.Ссылка)
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	НЕ ЕдиницыИзмерения.ПометкаУдаления
		|	И ЕдиницыИзмерения.Владелец ССЫЛКА Справочник.Номенклатура
		|	И НЕ ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура) В
		|				(ВЫБРАТЬ
		|					ВТ_ДопИзмеренияИзТЧ.Номенклатура
		|				ИЗ
		|					ВТ_ДопИзмеренияИзТЧ КАК ВТ_ДопИзмеренияИзТЧ)
		|	И ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура) В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_ТЧ.Номенклатура
		|			ИЗ
		|				ВТ_ТЧ КАК ВТ_ТЧ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧ.Номенклатура,
		|	ЕСТЬNULL(ВТ_Штрихкоды.Штрихкод, """") КАК Штрихкод,
		|	ВТ_ТЧ.Склад,
		|	СУММА(ВТ_ТЧ.КоличествоХранения) КАК КоличествоХранения,
		|	ВТ_ТЧ.Водитель
		|ПОМЕСТИТЬ ВТ_БезКоэфициента
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Штрихкоды КАК ВТ_Штрихкоды
		|		ПО ВТ_ТЧ.Номенклатура = ВТ_Штрихкоды.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТЧ.Номенклатура,
		|	ЕСТЬNULL(ВТ_Штрихкоды.Штрихкод, """"),
		|	ВТ_ТЧ.Склад,
		|	ВТ_ТЧ.Водитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_БезКоэфициента.Номенклатура КАК Номенклатура,
		|	ВТ_БезКоэфициента.Штрихкод,
		|	ВТ_БезКоэфициента.Склад,
		|	ВТ_БезКоэфициента.КоличествоХранения,
		|	ЕСТЬNULL(ВТ_ДопЕдиницы.ДопЕдИзм.Коэффициент, 0) КАК Коэффициент,
		|	ЕСТЬNULL(ВТ_ДопЕдиницы.ДопЕдИзм, """") КАК ДопЕдИзм,
		|	ВТ_БезКоэфициента.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияНоменклатуры,
		|	ВТ_БезКоэфициента.Водитель КАК Водитель
		|ИЗ
		|	ВТ_БезКоэфициента КАК ВТ_БезКоэфициента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопЕдиницы КАК ВТ_ДопЕдиницы
		|		ПО ВТ_БезКоэфициента.Номенклатура = ВТ_ДопЕдиницы.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|ИТОГИ ПО
		|	Водитель";
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Водители",		Объект.Водители.Выгрузить(Новый Структура("Пометка", Истина)).ВыгрузитьКолонку("Водитель"));
	
	Организация = Справочники.Организации.ОсновнаяОрганизация;
	Период = ?(НачалоПериода = КонецПериода, Формат(КонецПериода,"ДФ=dd.MM.yyyy"), Формат(НачалоПериода,"ДФ=dd.MM.yyyy")+ " - "+ Формат(КонецПериода,"ДФ=dd.MM.yyyy"));
	
	ВыборкаВодитель = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВодитель.Следующий() Цикл
	
		ОбластьШапка.Параметры.Организация			= Организация;
		ОбластьШапка.Параметры.Период				= Период;
		
		НайденныйВодители = Объект.Водители.НайтиСтроки(Новый Структура("Водитель", ВыборкаВодитель.Водитель));
		ОбластьШапка.Параметры.НомерТС				= НайденныйВодители[0].НомерТС;
		ОбластьШапка.Параметры.Водитель				= НайденныйВодители[0].Водитель;
		ОбластьШапка.Параметры.ТранспортноеСредство = НайденныйВодители[0].ТранспортноеСредство;
		ОбластьШапка.Параметры.СкладВодителя		= НайденныйВодители[0].СкладВодителя;
		ТабДок.Вывести(ОбластьШапка);

		Выборка = ВыборкаВодитель.Выбрать();
		НомерСтроки = 1;
		ВсегоШтука		= 0;
		ВсегоКоробка	= 0;
		ВсегоХранения	= 0;
		
		Пока Выборка.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			ОбластьСтрока.Параметры.Кол1 = ?(Выборка.Коэффициент = 0, "0", 									Строка(Цел(Выборка.КоличествоХранения/Выборка.Коэффициент))) +" "+?(Выборка.ДопЕдИзм = "", "ყუთი", Выборка.ДопЕдИзм);
			ОбластьСтрока.Параметры.Кол2 = ?(Выборка.Коэффициент = 0, Строка(Выборка.КоличествоХранения),	Строка(Цел(Выборка.КоличествоХранения%Выборка.Коэффициент))) +" "+Выборка.ЕдиницаИзмеренияНоменклатуры;
			ТабДок.Вывести(ОбластьСтрока);
			НомерСтроки = НомерСтроки + 1;
			ВсегоШтука		= ВсегоШтука 	+ ?(Выборка.Коэффициент = 0, Выборка.КоличествоХранения, Строка(Цел(Выборка.КоличествоХранения%Выборка.Коэффициент)));
			ВсегоКоробка	= ВсегоКоробка 	+ ?(Выборка.Коэффициент = 0, 0, 						 Строка(Цел(Выборка.КоличествоХранения/Выборка.Коэффициент)));
			ВсегоХранения	= ВсегоХранения + Выборка.КоличествоХранения;
			
		КонецЦикла;
		

		ОбластьПодвал.Параметры.ВсегоШтука		= ВсегоШтука;
		ОбластьПодвал.Параметры.ВсегоКоробка	= ВсегоКоробка;
		ОбластьПодвал.Параметры.ВсегоХранения	= ВсегоХранения;
		ТабДок.Вывести(ОбластьПодвал);
	КонецЦикла;
	
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьВодители()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ОПТИМУС_Дистрибуция.Ссылка) КАК Ссылка,
		|	ОПТИМУС_Дистрибуция.ТранспортноеСредство
		|ПОМЕСТИТЬ ВТ_ТранспортныеСредства
		|ИЗ
		|	ПланОбмена.ОПТИМУС_Дистрибуция КАК ОПТИМУС_Дистрибуция
		|ГДЕ
		|	НЕ ОПТИМУС_Дистрибуция.ПометкаУдаления
		|	И НЕ ОПТИМУС_Дистрибуция.ТранспортноеСредство = ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)
		|	И НЕ ОПТИМУС_Дистрибуция.ТранспортноеСредство.ОсновнойВодитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОПТИМУС_Дистрибуция.ТранспортноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОПТИМУС_Дистрибуция.СтруктурнаяЕдиница КАК СкладВодителя,
		|	ОПТИМУС_Дистрибуция.ТранспортноеСредство,
		|	ОПТИМУС_Дистрибуция.ТранспортноеСредство.ОсновнойВодитель КАК Водитель,
		|	ОПТИМУС_Дистрибуция.Ответственный,
		|	ОПТИМУС_Дистрибуция.ТранспортноеСредство.Код КАК НомерТС,
		|	ИСТИНА КАК Пометка
		|ИЗ
		|	ПланОбмена.ОПТИМУС_Дистрибуция КАК ОПТИМУС_Дистрибуция
		|ГДЕ
		|	ОПТИМУС_Дистрибуция.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ТранспортныеСредства.Ссылка
		|			ИЗ
		|				ВТ_ТранспортныеСредства КАК ВТ_ТранспортныеСредства)";
	Объект.Водители.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры


&НаКлиенте
Процедура ПометитьВсе(Команда)
	Для Каждого СтрокаТЧ Из Объект.Водители Цикл 
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура СнятьПометку(Команда)
	Для Каждого СтрокаТЧ Из Объект.Водители Цикл 
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
